{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Ken&#39;s Blog",
  "language": "en",
  "home_page_url": "https://example.com/",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "I am writing about my experiences as a naval navel-gazer.",
  "author": {
    "name": "Ken Stevens",
    "url": "https://example.com/about-me/"
  },
  "items": [{
      "id": "https://example.com/posts/Glad-Tidings/",
      "url": "https://example.com/posts/Glad-Tidings/",
      "title": "Glad Tidings",
      "content_html": "<center><bold>Luke 2:10</bold></center>\n<center><italics>I bring you good tidings of great joy.</italics></center>\n<br />\nJoy is an essential element of Christmas and the message of the first Christmas was a joyful one. Many people today depend for their Christmas joy on material things like good food, friends, fun, parties, and presents. By contrast the\nfirst Christmas was characterized by cold, bareness, and rejection, and it was in that atmosphere that the angel brought \"good tidings of great joy.\"\n<p>Jesus Christ was born into a world of oppression and cruelty. Palestine was in the grip of Rome and had been, as historians put it, bludgeoned into submission. It was a world of military might, vice, lust, and great wickedness. Romans 1 describes the permissiveness of the world into which Jesus was born. So today we are living in a bad world in which permissiveness is blatant on radio, television, and billboards, and in paperback novels and glossy magazines.</p>\n<p>In spite of centuries of education reform, politics, science and philosophy, the world of the twentieth century, with its permissiveness and pornography, is comparable to that of the first century. Since the world still needs a Savior, the message that Jesus Christ is born today is still good news.</p>\n<p>Since Rome had become master of that ancient world, there were no wars. Warfare is impossible when the people are in subjection. But a subject, terrorized people are a joyless lot. Jesus was born into a world that knew little but sadness and despair. His countrymen were heavily taxed by Rome to keep them submissive. Then came the angel with joyful news as all heaven broke bounds (G. Campbell Morgan). Jesus Christ, God‚ Savior, and Deliverer had been born. He who alone could deal with sin, not just human misery and abjection, had arrived!</p>\n<p>The One who was going to take the sting out of death had been born in Bethlehem and His name was Jesus‚ Savior for He shall save His people from their sins.</p>\n<p>The angel's message was not only to the shepherds; it was to<br />\nall people. It was a universal message. Beginning with humble shepherds and continuing with Wise Men, King Herod, the Jews, then the Gentiles, it soon became known throughout the Roman world. How did the world first hear this good and glad news? After seeing the new-born King for themselves, they went back to their daily work and, on the way and on every day, told others what the angel had told them and what they had seen for themselves.</p>\n<p>After Christmas the holiday is over, we recommence our daily daily and common activities, providing us with opportunities for spreading the good and glad news. The Baby grew up and became a man, the Light of the World, as He described himself: not a Christmas candle that is easily blown out; not Christmas tree lights that go on and off; but a bright and shining perpetual light to our dark world. Leaving His cradle and going to the cross, there we see the Light burning at its brightest. It is finished. What He<br />\nwas born to do‚ to save the world from sin‚ He completed upon the cross of Calvary.</p>\n",
      "date_published": "2019-12-22T01:47:26Z"
    },{
      "id": "https://example.com/posts/pride/",
      "url": "https://example.com/posts/pride/",
      "title": "Pride",
      "content_html": "<p>Back at the close of he sixth century Pope Gregory classified all sins under seven distinct sins.<br />\nThese were pride, anger, envy, impurity, gluttony, slothfulness, and avarice. These became known<br />\nas the Seven Deadly Sins. It is the first one on the list I wish to discuss today. It is Pride.</p>\n<p>The question that faces us today is pride ever not a sin. For example, is pride<br />\nin your children's accomplishments a sin. Read on, the answer may surprise you.</p>\n<p>Refer to Proverbs 6:16-19</p>\n<pre><code>  16¬†There are six things that the Lord hates,\n  seven that are an abomination to him:\n  17¬†haughty eyes, a lying tongue,\n  and hands that shed innocent blood,\n  18¬†a heart that devises wicked plans,\n  feet that make haste to run to evil,\n  19¬†a false witness who breathes out lies,\n  and one who sows discord among brothers\n</code></pre>\n<p>As it says in verse 16, there are 6 things, then the author, under the<br />\ninspiration of God, changes his mind and says 7 things that the Lord hates, no,<br />\nwait, he says is an abomination to the Lord. On top of the list is haughty eyes.<br />\nThe lifting up of one‚Äôs eyelids expresses haughtiness and pride. Pride. That is<br />\non top of the list. At the very least God hates pride and at most he finds it an<br />\nabomination.</p>\n<p>Now let's refer to Proverbs 8:12-13</p>\n<pre><code>  12¬†‚ÄúI, wisdom, dwell with prudence,\n  and I find knowledge and discretion.\n  13¬†The fear of the Lord is hatred of evil.\n  Pride and arrogance and the way of evil\n  and perverted speech I hate.\n</code></pre>\n<p>Pride and arrogance again He hates. He doesn't give an exception of pride that<br />\nsays its OK. Let's look at a few more verses.</p>\n<p>Proverbs 21:3-4 says:</p>\n<pre><code>  3¬†To do righteousness and justice\n  is more acceptable to the Lord than sacrifice.\n  4¬†Haughty eyes and a proud heart,\n  the lamp of the wicked, are sin.\n</code></pre>\n<p>Haughty eyes and a Proud heart are sin. God does not mince words. He says,<br />\nbeyond a shadow of a doubt, it's sin.</p>\n<p>Let's try a few verses from the New Testament. Mark 7:20-23;</p>\n<p>20¬†And he said, ‚ÄúWhat comes out of a person is what defiles him.<br />\n21¬†For from within, out of the heart of man, come evil thoughts, sexual<br />\nimmorality, theft, murder, adultery,<br />\n22¬†coveting, wickedness, deceit, sensuality, envy, slander, pride, foolishness.<br />\n23¬†All these evil things come from within, and they defile a person.‚Äù</p>\n<p>Here, God calls pride an &quot;evil thing&quot;.</p>\n<p>In 1 Perter 5:5</p>\n<p>5¬†Likewise, you who are younger, be subject to the elders. Clothe yourselves,<br />\nall of you, with humility toward one another, for ‚ÄúGod opposes the proud but<br />\ngives grace to the humble.‚Äù</p>\n<p>God opposes the proud, but He gives grace to the humble. So if you are proud God<br />\nwill oppose you. If you want to live under God's grace be humble.</p>\n<p>God's word has many place where it calls pride a sin. It calls pride an<br />\nabomination to the Lord. It gives no exceptions of pride being not a sin. So<br />\nPride in your children's accomplish is a sin, lest the child becomes prideful and<br />\nboasts.</p>\n<p>So, we should experience joy in accomplishments or their child's accomplishments, but never pride.</p>\n<p>Let me close with this:</p>\n<p>\n    ‚Ä¢      We take pride in birth and rank, but it‚Äôs said of Jesus, He was a carpenter‚Äôs son.\n   <br />\n   ‚Ä¢      We take pride in possessions, but it‚Äôs said of Jesus, ‚ÄúThe Son of man hath no place to lay His head.‚Äù\n   <br />\n    ‚Ä¢      We take pride in our respectability, but it‚Äôs said of Jesus, ‚ÄúCan anything good come out of Nazareth?‚Äù\n    <br />\n    ‚Ä¢      We take pride in our personal appearance, but it‚Äôs said of Jesus, ‚ÄúHe hath no form nor comeliness.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our reputation, but it‚Äôs said of Jesus, ‚ÄúBehold a man gluttonous and a winebibber.‚Äù\n<br />\n    ‚Ä¢      We take pride in our friendships, but it‚Äôs said of Jesus, ‚ÄúHe was a friend of publicans and sinners.‚Äù\n<br />\n    ‚Ä¢      We take pride in our independence, but Jesus gave himself to people and had the woman at the well draw water for him.\n<br />\n    ‚Ä¢      We take pride in our degrees and learning, but Jesus never went to college and it‚Äôs said of Him, ‚ÄúHow knows this man letters having never learned to read?‚Äù\n    <br />\n    ‚Ä¢      We take pride in our position, but Jesus said, ‚ÄúI am among you as one who serves.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our success, but it‚Äôs said of Jesus, ‚ÄúHis own did not receive Him or believe on Him. He was despised and rejected.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our self-reliance, but it‚Äôs said of Jesus, ‚ÄúHe went down to Nazareth and was subject to His parents.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our abilities, but Jesus said, ‚ÄúI can of mine own self do nothing.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our self-will, but Jesus said, ‚ÄúI seek not my own will but the Father‚Äôs.‚Äù And ‚ÄúIf thou be willing, remove this cup from me, nevertheless not my will but thine be done.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our intellect, but Jesus said, ‚ÄúAs the Father has taught me, I speak these things.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our resentment and justifiable pride, but Jesus said, ‚ÄúFather, forgive them.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our holiness, but it‚Äôs said of Jesus, ‚ÄúHe receiveth sinners and eateth with them.‚Äù\n    <br />\n    ‚Ä¢      We take pride in the fact we‚Äôre the righteousness of God, but it‚Äôs said of Jesus, ‚ÄúHe who knew no sin became sin on our behalf in order that we might become the righteousness of God in Him.‚Äù\n</p>\n",
      "date_published": "2019-09-07T01:43:29Z"
    }
  ]
}
