{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Ken&#39;s Blog",
  "language": "en",
  "home_page_url": "https://example.com/",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "I am writing about my experiences as a naval navel-gazer.",
  "author": {
    "name": "Ken Stevens",
    "url": "https://example.com/about-me/"
  },
  "items": [{
      "id": "https://example.com/posts/The-Church-an-exhortation-to-unity/",
      "url": "https://example.com/posts/The-Church-an-exhortation-to-unity/",
      "title": "The Church - an exhortation to unity",
      "content_html": "<p>I started this blog in 2019. I made two posts and then no more after that, Now that I have retired to the Philippines I'm praying that I will have more time to devote to this blog. Hopefully what I have to say will be of interest to someone and maybe help someone find the path they are meant to tread.</p>\n<p>Psalm 133</p>\n<p>Psa 133:1  A Song of Ascents. Of David. Behold, how good and pleasant it is when brothers dwell in unity!</p>\n<p>Psa 133:2  It is like the precious oil on the head, running down on the beard, on the beard of Aaron, running down on the collar of his robes!</p>\n<p>Psa 133:3  It is like the dew of Hermon, which falls on the mountains of Zion! For there the LORD has commanded the blessing, life forevermore.</p>\n<p>Unity is a pressing need within the Church of the Lord Jesus Christ. Where there is unity there is strength. Jesus said a house divided against itself shall fall. Now unity and union are not the same. Unity: State of being one—as a body is one organism. Union: Act or instance of uniting two or more things into one organization.</p>\n<ol>\n<li>The church should have unity bwcause the Church is one - the body of Christ.</li>\n</ol>\n<p>1 Corinthians 12:12-13</p>\n<p>1Co 12:12  For just as the body is one and has many members, and all the members of the body, though many, are one body, so it is with Christ.<br />\n1Co 12:13  For in one Spirit we were all baptized into one body—Jews or Greeks, slaves or free—and all were made to drink of one Spirit.</p>\n<p>Ephesians 4:4-6</p>\n<p>Eph 4:4  There is one body and one Spirit—just as you were called to the one hope that belongs to your call—<br />\nEph 4:5  one Lord, one faith, one baptism,<br />\nEph 4:6  one God and Father of all, who is over all and through all and in all.</p>\n<p>Since the Church is one, if any member suffers, the whole body suffers.</p>\n<pre><code>1 Corinthians 12:25-26\n\n1Co 12:25  that there may be no division in the body, but that the members may have the same care for one another.\n1Co 12:26  If one member suffers, all suffer together; if one member is honored, all rejoice together.\n\nThe Church as a body can only function properly when all members are working together.\n\n  1 Corinthians 12:20-24\n\n  1Co 12:20  As it is, there are many parts, yet one body.\n  1Co 12:21  The eye cannot say to the hand, “I have no need of you,” nor again the head to the feet, “I have no need of you.”\n  1Co 12:22  On the contrary, the parts of the body that seem to be weaker are indispensable,\n  1Co 12:23  and on those parts of the body that we think less honorable we bestow the greater honor, and our unpresentable parts are treated with greater modesty,\n  1Co 12:24  which our more presentable parts do not require. But God has so composed the body, giving greater honor to the part that lacked it,\n\n  2. The Church can have unity because of te abiding presence of the Holy Spirit.\n\n  John 14:16-17\n\n  Joh 14:16  And I will ask the Father, and he will give you another Helper, to be with you forever,\n  Joh 14:17  even the Spirit of truth, whom the world cannot receive, because it neither sees him nor knows him. You know him, for he dwells with you and will be in you.\n\n  One thing to make note of here is that the Holy Spirit came when the Church was of one accord.\n\n  Acts 2:1-4\n\n  Act 2:1  When the day of Pentecost arrived, they were all together in one place.\n  Act 2:2  And suddenly there came from heaven a sound like a mighty rushing wind, and it filled the entire house where they were sitting.\n  Act 2:3  And divided tongues as of fire appeared to them and rested on each one of them.\n  Act 2:4  And they were all filled with the Holy Spirit and began to speak in other tongues as the Spirit gave them utterance.\n\n  And after He (the Holy Spirit) came see Acts 2:42-47\n\n  Act 2:42  And they devoted themselves to the apostles' teaching and the fellowship, to the breaking of bread and the prayers.\n  Act 2:43  And awe came upon every soul, and many wonders and signs were being done through the apostles.\n  Act 2:44  And all who believed were together and had all things in common.\n  Act 2:45  And they were selling their possessions and belongings and distributing the proceeds to all, as any had need.\n  Act 2:46  And day by day, attending the temple together and breaking bread in their homes, they received their food with glad and generous hearts,\n  Act 2:47  praising God and having favor with all the people. And the Lord added to their number day by day those who were being saved.\n\n  In John 17:20-21 Christ prayed that we have unity, God will surely answer is prayer.\n\n  Joh 17:20  “I do not ask for these only, but also for those who will believe in me through their word,\n  Joh 17:21  that they may all be one, just as you, Father, are in me, and I in you, that they also may be in us, so that the world may believe that you have sent me.\n\n  3. How can the Church maintain this unity.\n\n  The Church can maintain this unity by faith. (Ephesians 3:14-17)\n\n  Eph 3:14  For this reason I bow my knees before the Father,\n  Eph 3:15  from whom every family in heaven and on earth is named,\n  Eph 3:16  that according to the riches of his glory he may grant you to be strengthened with power through his Spirit in your inner being,\n  Eph 3:17  so that Christ may dwell in your hearts through faith…\n\n  The Church can maintain this unity by abiding in Christ and obeying His Word. (John 15:7)\n\n  Joh 15:7  If you abide in me, and my words abide in you, ask whatever you wish, and it will be done for you.\n\n  2 John 9\n\n  2Jn 1:9  Everyone who goes on ahead and does not abide in the teaching of Christ, does not have God. Whoever abides in the teaching has both the Father and the Son.\n\n  1 John 3:24\n\n  1Jn 3:24  Whoever keeps his commandments abides in God, and God in him. And by this we know that he abides in us, by the Spirit whom he has given us.\n\n  The Church can maintain this unity by putting forth ab effot (Eph 4:1-3)\n\n  Eph 4:1  I therefore, a prisoner for the Lord, urge you to walk in a manner worthy of the calling to which you have been called,\n  Eph 4:2  with all humility and gentleness, with patience, bearing with one another in love,\n  Eph 4:3  eager to maintain the unity of the Spirit in the bond of peace.\n\n  4. What this unity will bring the Church.\n\n  It will bring the church maturity (Ephesians 4:11-13).\n\n  Eph 4:11  And he gave the apostles, the prophets, the evangelists, the shepherds and teachers,\n  Eph 4:12  to equip the saints for the work of ministry, for building up the body of Christ,\n  Eph 4:13  until we all attain to the unity of the faith and of the knowledge of the Son of God, to mature manhood, to the measure of the stature of the fullness of Christ,\n  Eph 4:14  so that we may no longer be children, tossed to and fro by the waves and carried about by every wind of doctrine, by human cunning, by craftiness in deceitful schemes.\n\n  It will bring the Church stability (Ephesian 4:14).\n\n  Eph 4:14  so that we may no longer be children, tossed to and fro by the waves and carried about by every wind of doctrine, by human cunning, by craftiness in deceitful schemes.\n\n  It will bring the Church love for each other (Ephesian 4:15-16).\n\n  Eph 4:15  Rather, speaking the truth in love, we are to grow up in every way into him who is the head, into Christ,\n  Eph 4:16  from whom the whole body, joined and held together by every joint with which it is equipped, when each part is working properly, makes the body grow so that it builds itself up in love.\n\n  It will bring the Church rejoicing (1 Corinthians 12:26).\n\n  1Co 12:26  If one member suffers, all suffer together; if one member is honored, all rejoice together.\n\n  It will bring the Church power (Acts 2:41;4-4;4:23-31).\n\n  Act 2:41  So those who received his word were baptized, and there were added that day about three thousand souls.\n\n  Act 4:4  But many of those who had heard the word believed, and the number of the men came to about five thousand.\n\n  Act 4:23  When they were released, they went to their friends and reported what the chief priests and the elders had said to them.\n  Act 4:24  And when they heard it, they lifted their voices together to God and said, “Sovereign Lord, who made the heaven and the earth and the sea and everything in them,\n  Act 4:25  who through the mouth of our father David, your servant, said by the Holy Spirit, “‘Why did the Gentiles rage, and the peoples plot in vain?\n  Act 4:26  The kings of the earth set themselves, and the rulers were gathered together, against the Lord and against his Anointed’—\n  Act 4:27  for truly in this city there were gathered together against your holy servant Jesus, whom you anointed, both Herod and Pontius Pilate, along with the Gentiles and the peoples of Israel,\n  Act 4:28  to do whatever your hand and your plan had predestined to take place.\n  Act 4:29  And now, Lord, look upon their threats and grant to your servants to continue to speak your word with all boldness,\n  Act 4:30  while you stretch out your hand to heal, and signs and wonders are performed through the name of your holy servant Jesus.”\n  Act 4:31  And when they had prayed, the place in which they were gathered together was shaken, and they were all filled with the Holy Spirit and continued to speak the word of God with boldness.\n</code></pre>\n",
      "date_published": "2021-07-19T12:27:40Z"
    },{
      "id": "https://example.com/posts/Glad-Tidings/",
      "url": "https://example.com/posts/Glad-Tidings/",
      "title": "Glad Tidings",
      "content_html": "<center><bold>Luke 2:10</bold></center>\n<center><italics>I bring you good tidings of great joy.</italics></center>\n<br />\nJoy is an essential element of Christmas and the message of the first Christmas was a joyful one. Many people today depend for their Christmas joy on material things like good food, friends, fun, parties, and presents. By contrast the\nfirst Christmas was characterized by cold, bareness, and rejection, and it was in that atmosphere that the angel brought \"good tidings of great joy.\"\n<p>Jesus Christ was born into a world of oppression and cruelty. Palestine was in the grip of Rome and had been, as historians put it, bludgeoned into submission. It was a world of military might, vice, lust, and great wickedness. Romans 1 describes the permissiveness of the world into which Jesus was born. So today we are living in a bad world in which permissiveness is blatant on radio, television, and billboards, and in paperback novels and glossy magazines.</p>\n<p>In spite of centuries of education reform, politics, science and philosophy, the world of the twentieth century, with its permissiveness and pornography, is comparable to that of the first century. Since the world still needs a Savior, the message that Jesus Christ is born today is still good news.</p>\n<p>Since Rome had become master of that ancient world, there were no wars. Warfare is impossible when the people are in subjection. But a subject, terrorized people are a joyless lot. Jesus was born into a world that knew little but sadness and despair. His countrymen were heavily taxed by Rome to keep them submissive. Then came the angel with joyful news as all heaven broke bounds (G. Campbell Morgan). Jesus Christ, God‚ Savior, and Deliverer had been born. He who alone could deal with sin, not just human misery and abjection, had arrived!</p>\n<p>The One who was going to take the sting out of death had been born in Bethlehem and His name was Jesus‚ Savior for He shall save His people from their sins.</p>\n<p>The angel's message was not only to the shepherds; it was to<br />\nall people. It was a universal message. Beginning with humble shepherds and continuing with Wise Men, King Herod, the Jews, then the Gentiles, it soon became known throughout the Roman world. How did the world first hear this good and glad news? After seeing the new-born King for themselves, they went back to their daily work and, on the way and on every day, told others what the angel had told them and what they had seen for themselves.</p>\n<p>After Christmas the holiday is over, we recommence our daily daily and common activities, providing us with opportunities for spreading the good and glad news. The Baby grew up and became a man, the Light of the World, as He described himself: not a Christmas candle that is easily blown out; not Christmas tree lights that go on and off; but a bright and shining perpetual light to our dark world. Leaving His cradle and going to the cross, there we see the Light burning at its brightest. It is finished. What He<br />\nwas born to do‚ to save the world from sin‚ He completed upon the cross of Calvary.</p>\n",
      "date_published": "2019-12-22T01:47:26Z"
    },{
      "id": "https://example.com/posts/pride/",
      "url": "https://example.com/posts/pride/",
      "title": "Pride",
      "content_html": "<p>Back at the close of he sixth century Pope Gregory classified all sins under seven distinct sins.<br />\nThese were pride, anger, envy, impurity, gluttony, slothfulness, and avarice. These became known<br />\nas the Seven Deadly Sins. It is the first one on the list I wish to discuss today. It is Pride.</p>\n<p>The question that faces us today is pride ever not a sin. For example, is pride<br />\nin your children's accomplishments a sin. Read on, the answer may surprise you.</p>\n<p>Refer to Proverbs 6:16-19</p>\n<pre><code>  16¬†There are six things that the Lord hates,\n  seven that are an abomination to him:\n  17¬†haughty eyes, a lying tongue,\n  and hands that shed innocent blood,\n  18¬†a heart that devises wicked plans,\n  feet that make haste to run to evil,\n  19¬†a false witness who breathes out lies,\n  and one who sows discord among brothers\n</code></pre>\n<p>As it says in verse 16, there are 6 things, then the author, under the<br />\ninspiration of God, changes his mind and says 7 things that the Lord hates, no,<br />\nwait, he says is an abomination to the Lord. On top of the list is haughty eyes.<br />\nThe lifting up of one‚Äôs eyelids expresses haughtiness and pride. Pride. That is<br />\non top of the list. At the very least God hates pride and at most he finds it an<br />\nabomination.</p>\n<p>Now let's refer to Proverbs 8:12-13</p>\n<pre><code>  12¬†‚ÄúI, wisdom, dwell with prudence,\n  and I find knowledge and discretion.\n  13¬†The fear of the Lord is hatred of evil.\n  Pride and arrogance and the way of evil\n  and perverted speech I hate.\n</code></pre>\n<p>Pride and arrogance again He hates. He doesn't give an exception of pride that<br />\nsays its OK. Let's look at a few more verses.</p>\n<p>Proverbs 21:3-4 says:</p>\n<pre><code>  3¬†To do righteousness and justice\n  is more acceptable to the Lord than sacrifice.\n  4¬†Haughty eyes and a proud heart,\n  the lamp of the wicked, are sin.\n</code></pre>\n<p>Haughty eyes and a Proud heart are sin. God does not mince words. He says,<br />\nbeyond a shadow of a doubt, it's sin.</p>\n<p>Let's try a few verses from the New Testament. Mark 7:20-23;</p>\n<p>20¬†And he said, ‚ÄúWhat comes out of a person is what defiles him.<br />\n21¬†For from within, out of the heart of man, come evil thoughts, sexual<br />\nimmorality, theft, murder, adultery,<br />\n22¬†coveting, wickedness, deceit, sensuality, envy, slander, pride, foolishness.<br />\n23¬†All these evil things come from within, and they defile a person.‚Äù</p>\n<p>Here, God calls pride an &quot;evil thing&quot;.</p>\n<p>In 1 Perter 5:5</p>\n<p>5¬†Likewise, you who are younger, be subject to the elders. Clothe yourselves,<br />\nall of you, with humility toward one another, for ‚ÄúGod opposes the proud but<br />\ngives grace to the humble.‚Äù</p>\n<p>God opposes the proud, but He gives grace to the humble. So if you are proud God<br />\nwill oppose you. If you want to live under God's grace be humble.</p>\n<p>God's word has many place where it calls pride a sin. It calls pride an<br />\nabomination to the Lord. It gives no exceptions of pride being not a sin. So<br />\nPride in your children's accomplish is a sin, lest the child becomes prideful and<br />\nboasts.</p>\n<p>So, we should experience joy in accomplishments or their child's accomplishments, but never pride.</p>\n<p>Let me close with this:</p>\n<p>\n    ‚Ä¢      We take pride in birth and rank, but it‚Äôs said of Jesus, He was a carpenter‚Äôs son.\n   <br />\n   ‚Ä¢      We take pride in possessions, but it‚Äôs said of Jesus, ‚ÄúThe Son of man hath no place to lay His head.‚Äù\n   <br />\n    ‚Ä¢      We take pride in our respectability, but it‚Äôs said of Jesus, ‚ÄúCan anything good come out of Nazareth?‚Äù\n    <br />\n    ‚Ä¢      We take pride in our personal appearance, but it‚Äôs said of Jesus, ‚ÄúHe hath no form nor comeliness.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our reputation, but it‚Äôs said of Jesus, ‚ÄúBehold a man gluttonous and a winebibber.‚Äù\n<br />\n    ‚Ä¢      We take pride in our friendships, but it‚Äôs said of Jesus, ‚ÄúHe was a friend of publicans and sinners.‚Äù\n<br />\n    ‚Ä¢      We take pride in our independence, but Jesus gave himself to people and had the woman at the well draw water for him.\n<br />\n    ‚Ä¢      We take pride in our degrees and learning, but Jesus never went to college and it‚Äôs said of Him, ‚ÄúHow knows this man letters having never learned to read?‚Äù\n    <br />\n    ‚Ä¢      We take pride in our position, but Jesus said, ‚ÄúI am among you as one who serves.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our success, but it‚Äôs said of Jesus, ‚ÄúHis own did not receive Him or believe on Him. He was despised and rejected.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our self-reliance, but it‚Äôs said of Jesus, ‚ÄúHe went down to Nazareth and was subject to His parents.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our abilities, but Jesus said, ‚ÄúI can of mine own self do nothing.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our self-will, but Jesus said, ‚ÄúI seek not my own will but the Father‚Äôs.‚Äù And ‚ÄúIf thou be willing, remove this cup from me, nevertheless not my will but thine be done.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our intellect, but Jesus said, ‚ÄúAs the Father has taught me, I speak these things.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our resentment and justifiable pride, but Jesus said, ‚ÄúFather, forgive them.‚Äù\n    <br />\n    ‚Ä¢      We take pride in our holiness, but it‚Äôs said of Jesus, ‚ÄúHe receiveth sinners and eateth with them.‚Äù\n    <br />\n    ‚Ä¢      We take pride in the fact we‚Äôre the righteousness of God, but it‚Äôs said of Jesus, ‚ÄúHe who knew no sin became sin on our behalf in order that we might become the righteousness of God in Him.‚Äù\n</p>\n",
      "date_published": "2019-09-07T01:43:29Z"
    }
  ]
}
